Revit 2024 API
RebarShapeVertex.Turn Property
 The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarShapeVertexTurn Turn { get; set; }
Visual Basic
Public Property Turn As RebarShapeVertexTurn
	Get
	Set
Visual C++
public:
property RebarShapeVertexTurn Turn {
	RebarShapeVertexTurn get ();
	void set (RebarShapeVertexTurn value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: turn must be Left or Right.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace